IdeaRS.Connections
MemberGeneralWeldData Class
Compatible with IDEA StatiCa 0.0
 Data for General weld on Steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.GeneralWeldData
 IdeaRS.Connections.Data.MemberGeneralWeldData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberGeneralWeldData : GeneralWeldData
The MemberGeneralWeldData type exposes the following members.
Constructors
Name | Description
MemberGeneralWeldData
Initializes a new instance of the MemberGeneralWeldData class
Top
Properties
Name | Description
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
SurfaceEdgeInx |  (Inherited from GeneralWeldData.)
Weld
 Gets or sets the properties of the connected member to plate weld
 (Inherited from GeneralWeldData.)
WeldedEdgeIndexes |  (Inherited from GeneralWeldData.)
WeldedEdgeInx |  (Inherited from GeneralWeldData.)
WeldedMemberEdgePath |  (Inherited from GeneralWeldData.)
WeldedMemberSurfacePath |  (Inherited from GeneralWeldData.)
WeldedPlateEdgePath |  (Inherited from GeneralWeldData.)
WeldedPlateSurfacePath |  (Inherited from GeneralWeldData.)
WeldPlacement |  (Inherited from GeneralWeldData.)
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace